Documents/ЗагрузкаКамеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗагрузкаКамеры</Name>
			<BasedOn>
				<xr:Item>Document.НачалоТермообработки</xr:Item>
				<xr:Item>Document.ЗагрузкаКамеры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КамераТермообработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КамерыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодПрограммыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗанятаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаКамеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНеоконченыеПроцессы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогРамПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРамы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоРам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоТермообработки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗагрузкаКамеры/Ext/ObjectModule.bsl
// Проверка заполнения шапки
Функция ПроверитьШапку(ОбъектДок, Отказ)

	Если НЕ ЗначениеЗаполнено(ОбъектДок.КамераТермообработки) Тогда
		СообщениеОбОшибке = Новый СообщениеПользователю;
		СообщениеОбОшибке.Текст = "Не заполнена Камера термообработки!";
		СообщениеОбОшибке.Поле = "КамераТермообработки";
		СообщениеОбОшибке.УстановитьДанные(ОбъектДок);
		СообщениеОбОшибке.Сообщить();
		Отказ = Истина;
	КонецЕсли; // Если НЕ ЗначениеЗаполнено КамераТермообработки // + claude

	Если НЕ ЗначениеЗаполнено(ОбъектДок.ПодПрограмма) Тогда
		СообщениеОбОшибке = Новый СообщениеПользователю;
		СообщениеОбОшибке.Текст = "Не заполнена Подпрограмма!";
		СообщениеОбОшибке.Поле = "ПодПрограмма";
		СообщениеОбОшибке.УстановитьДанные(ОбъектДок);
		СообщениеОбОшибке.Сообщить();
		Отказ = Истина;
	КонецЕсли; // Если НЕ ЗначениеЗаполнено ПодПрограмма // + claude

КонецФункции // ПроверитьШапку // + claude

// Проверка заполнения строк ТЧ
Функция ПроверитьСтроки(ОбъектДок, Отказ)

	Для Каждого Строка Из ОбъектДок.ТМЦ Цикл

		Если НЕ ЗначениеЗаполнено(Строка.ТМЦ) Тогда
			СообщениеОбОшибке = Новый СообщениеПользователю;
			СообщениеОбОшибке.Текст = "Не заполнено поле ТМЦ в строке " + Строка.НомерСтроки + "!";
			СообщениеОбОшибке.Поле = "ТМЦ[" + (Строка.НомерСтроки - 1) + "].ТМЦ";
			СообщениеОбОшибке.УстановитьДанные(ОбъектДок);
			СообщениеОбОшибке.Сообщить();
			Отказ = Истина;
			Возврат Ложь;
		КонецЕсли; // Если НЕ ЗначениеЗаполнено ТМЦ // + claude

	КонецЦикла; // Для Каждого Строка // + claude

	Возврат Истина;

КонецФункции // ПроверитьСтроки // + claude

// Расчет времени освобождения камеры на основании подпрограммы
Процедура РассчитатьВремяОсвобождения(ОбъектДок)

	Если НЕ ЗначениеЗаполнено(ОбъектДок.ПодПрограмма) Тогда
		Возврат;
	КонецЕсли; // Если НЕ ЗначениеЗаполнено ПодПрограмма // + claude

	ТекЧасовПрограммы = 0;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПроцессПодПрограммыТермообработки.ДлинаПроцесса КАК ДлинаПроцесса
		|ИЗ
		|	Справочник.ПроцессПодПрограммыТермообработки КАК ПроцессПодПрограммыТермообработки
		|ГДЕ
		|	ПроцессПодПрограммыТермообработки.Владелец = &ПодПрограмма
		|	И НЕ ПроцессПодПрограммыТермообработки.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПодПрограмма", ОбъектДок.ПодПрограмма);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ТекЧасовПрограммы = ТекЧасовПрограммы + Результат.ДлинаПроцесса;
	КонецЦикла; // Пока Результат.Следующий // + claude

	ОбъектДок.ЗанятаМинуты = ТекЧасовПрограммы * 60;

	// Рассчитываем время освобождения камеры
	ОбщоМинут                 = (ОбъектДок.ЗагруженаЧасы * 60) + ОбъектДок.ЗагруженаМинуты + ОбъектДок.ЗанятаМинуты;
	ОбъектДок.СвободнаДата    = ОбъектДок.Дата + Цел(ОбщоМинут / 1440);
	ОстатокМинут              = ОбщоМинут % 1440;
	ОбъектДок.СвободнаЧасы   = Цел(ОстатокМинут / 60);
	ОбъектДок.СвободнаМинуты = ОстатокМинут % 60;

КонецПроцедуры // РассчитатьВремяОсвобождения // + claude

// Обработка проведения документа
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроверитьШапку(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; // Если Отказ // + claude

	ПроверитьСтроки(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаПроведения // + claude

// Каскадный перерасчет подчиненных загрузок (ДокументОснование = текущий документ) —
// аналог СдвигДаты 1С77: время загрузки следующей камеры равно времени
// освобождения текущей // + claude
Процедура СдвигДатыПодчиненных()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагрузкаКамеры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗагрузкаКамеры КАК ЗагрузкаКамеры
		|ГДЕ
		|	ЗагрузкаКамеры.ДокументОснование = &ТекущийДокумент
		|	И НЕ ЗагрузкаКамеры.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		НоваяДата = НачалоДня(СвободнаДата) + СвободнаЧасы * 3600 + СвободнаМинуты * 60;

		ДокПодчиненный = Выборка.Ссылка.ПолучитьОбъект();

		Если ДокПодчиненный.Дата = НоваяДата
			И ДокПодчиненный.ЗагруженаЧасы = СвободнаЧасы
			И ДокПодчиненный.ЗагруженаМинуты = СвободнаМинуты Тогда
			Продолжить; // время не изменилось — дальше каскадировать не нужно // + claude
		КонецЕсли;

		ДокПодчиненный.Дата            = НоваяДата;
		ДокПодчиненный.ЗагруженаЧасы   = СвободнаЧасы;
		ДокПодчиненный.ЗагруженаМинуты = СвободнаМинуты;

		ОбщоМинут = (ДокПодчиненный.ЗагруженаЧасы * 60) + ДокПодчиненный.ЗагруженаМинуты + ДокПодчиненный.ЗанятаМинуты;
		ДокПодчиненный.СвободнаДата    = НачалоДня(СвободнаДата) + Цел(ОбщоМинут / 1440) * 86400;
		ОстатокМинут                   = ОбщоМинут - Цел(ОбщоМинут / 1440) * 1440;
		ДокПодчиненный.СвободнаЧасы    = Цел(ОстатокМинут / 60);
		ДокПодчиненный.СвободнаМинуты  = ОстатокМинут - Цел(ОстатокМинут / 60) * 60;

		// Запись подчиненного документа вызовет его собственный ПослеЗаписи
		// и продолжит каскад дальше по цепочке камер // + claude
		ДокПодчиненный.Записать(РежимЗаписиДокумента.Запись);

	КонецЦикла; // перебор подчиненных загрузок // + claude

КонецПроцедуры // СдвигДатыПодчиненных // + claude

Процедура ПослеЗаписи(ПараметрыЗаписи)

	СдвигДатыПодчиненных();

КонецПроцедуры // ПослеЗаписи // + claude

// Заполнение на основании НачалоТермообработки
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачалоТермообработки") Тогда

		СтандартнаяОбработка = Ложь;
		ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();

		ДокументОснование = ДанныеЗаполнения;
		ПодПрограмма      = ДокОснование.ПодПрограмма;
		Дата              = ДокОснование.Дата;

		Для Каждого СтрокаОснования Из ДокОснование.ТМЦ Цикл
			НоваяСтрока                      = ТМЦ.Добавить();
			НоваяСтрока.ТМЦ                  = СтрокаОснования.ТМЦ;
			НоваяСтрока.ВидРамы              = СтрокаОснования.ВидРамы;
			НоваяСтрока.Кво                  = СтрокаОснования.Кво;
			НоваяСтрока.КвоРам               = СтрокаОснования.КвоРам;
			НоваяСтрока.ОтчетПроизводства    = ДокОснование.ОтчетПроизводства;
			НоваяСтрока.НачалоТермообработки = ДанныеЗаполнения;
		КонецЦикла; // Для Каждого СтрокаОснования // + claude

		РассчитатьВремяОсвобождения(ЭтотОбъект);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗагрузкаКамеры") Тогда

		// Каскадне продовження термообробки в наступній камері — аналог
		// ВводНаОсновании 1С77 (ветка УМК_ЗагрузкаКамеры): нова загрузка
		// стартує рівно в момент звільнення попередньої камери // + claude
		СтандартнаяОбработка = Ложь;
		ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();

		ДокументОснование = ДанныеЗаполнения;
		ПодПрограмма      = ДокОснование.ПодПрограмма;

		Дата            = ДокОснование.СвободнаДата;
		ЗагруженаЧасы   = ДокОснование.СвободнаЧасы;
		ЗагруженаМинуты = ДокОснование.СвободнаМинуты;

		МинДата    = ДокОснование.СвободнаДата;
		МинЧасы    = ДокОснование.СвободнаЧасы;
		МинМинуты  = ДокОснование.СвободнаМинуты;
		МаксДата   = ДокОснование.СвободнаДата;
		МаксЧасы   = ДокОснование.СвободнаЧасы;
		МаксМинуты = ДокОснование.СвободнаМинуты;

		Для Каждого СтрокаОснования Из ДокОснование.ТМЦ Цикл
			НоваяСтрока                      = ТМЦ.Добавить();
			НоваяСтрока.ТМЦ                  = СтрокаОснования.ТМЦ;
			НоваяСтрока.ВидРамы              = СтрокаОснования.ВидРамы;
			НоваяСтрока.Кво                  = СтрокаОснования.Кво;
			НоваяСтрока.КвоРам               = СтрокаОснования.КвоРам;
			НоваяСтрока.ОтчетПроизводства    = СтрокаОснования.ОтчетПроизводства;
			НоваяСтрока.НачалоТермообработки = СтрокаОснования.НачалоТермообработки;
		КонецЦикла; // Для Каждого СтрокаОснования // + claude

		РассчитатьВремяОсвобождения(ЭтотОбъект);

	КонецЕсли; // Если ТипЗнч НачалоТермообработки // + claude

КонецПроцедуры // ОбработкаЗаполнения // + claude
